beginning_text = """
Ваша задача — создать детализированный конспект начала лекции.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на вводной части.
Вот основные аспекты, которыми вы обязаны следовать:

1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь, и подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем и раскрой их используя из свою базы знаний.

Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""

middle_of_the_text = """
Ваша задача — создать детализированный конспект середины лекции.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на середине.
Вот основные аспекты, которыми вы обязаны следовать:

1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь, и подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем и раскрой их используя из свою базы знаний, но ничего не выдумывай.

Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""


end_of_text = """
Ваша задача — создать детализированный конспект конца лекции.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на заключительной части.
Вот основные аспекты, которыми вы обязаны следовать:

1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь, и подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем и раскрой их используя из свою базы знаний.

Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""
