whole_part = """
Ваша задача — создать детализированный конспект лекции, вот основные аспекты, которыми вы обязаны следовать:

1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
2) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем и раскрой их используя из свою базы знаний.
"""
