start_message = """
Привет! Я - Конспект-бот, ваш помощник в создании конспектов.

Я умею:

🔹 Автоматически создавать подробные конспекты из аудио записей
🔹 Структурировать текст с помощью заголовков и нумерации

Чтобы начать, просто отправьте мне аудиосообщение с лекцией или докладом. Я быстро создам для вас подробный конспект, чтобы вы могли сосредоточиться на изучении материала, а не на рутинных записях.

Начните экономить время уже сегодня с помощью Конспект-бота!
"""

error = """⚠️ Произошла ошибка при обработке вашего сообщения. Пожалуйста, попробуйте отправить его снова. Извините за неудобства!"""