title = """
Не используйте символы markdown (*, #, ** и т.д.). Это обязательное требование.

Ты получаешь транскрибацию лекции.
Твоя задача — внимательно проанализировать её содержание и придумать короткое, емкое и информативное название, которое отражает основную тему и суть лекции.

Обрати внимание на ключевые моменты, основные идеи и цели лекции.
Постарайся, чтобы название было привлекающим внимание и понятным для широкой аудитории.
"""

key_terms_and_concepts = """
Не используйте символы markdown (*, #, ** и т.д.). Это обязательное требование.
Ты получаешь транскрипцию лекции. Твоя задача — внимательно проанализировать текст и выделить основные термины и понятия, обсуждаемые в лекции.
Для каждого найденного термина или понятия:

1. Укажи его название.
2. При необходимости добавь краткое пояснение или описание, отражающее его смысл и роль в лекции.
3. Оформи их как словарь Python, то есть в формате {"термин": "значение", "термин": "значение", ...}.

Если в транскрипции отсутствует термины или понятия, сообщи об этом.
"""

chronological_lecture_outline = """
Не используйте символы markdown (*, #, ** и т.д.). Это обязательное требование.
Ты получаешь транскрипцию лекции в виде неформатированного текста. Твоя задача — внимательно прочитать текст и составить подробный хронологический конспект лекции.

Если транскрипция не содержит явной хронологии или каких-либо важных разделов, сообщи об этом.
"""

mini_test = """
Не используйте символы markdown (*, #, ** и т.д.). Это обязательное требование.
Ты получаешь лекцию. Твоя задача — на основе прочитанного материала составить небольшой тест, который поможет проверить понимание основных тем лекции. При этом тест должен включать следующие элементы:

1.Вопросы: Сформулируй 5–10 вопросов, охватывающих ключевые идеи лекции. Вопросы могут быть как множественного выбора, так и открытого типа.

2. Ответы: Для каждого вопроса укажи правильный ответ или набор правильных ответов.

3. Объяснения: В конце теста составь подробное пояснение для каждого вопроса, описывая, почему выбран ответ является правильным, и при необходимости приводи примеры из лекции.

Старайся, чтобы тест был структурированным, понятным и логически последовательным, что позволит студенту проверить свои знания и глубже понять материал лекции.
"""
