beginning_text = """
Ваша задача — создать детализированный конспект начала лекции, она под номером 1.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на начале лекции.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Сделай его понятным для человека, вычлени только самое важное для понимания лекции. Стунденты не пишут об лектори в третьем лице, и так далее.
Вот основные аспекты, которыми вы можете следовать при создании конспекта:
1) Укажите цели лекции, вопросы или задачи.
2) Обозначьте ключевые термины, понятия или определения, введенные в начале лекции.
3) Оформи их в отдельном логическом блоке
4) Убедитесь, что текст является академическим и соответствует стандартам.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""

middle_of_the_text = """
Ваша задача — создать детализированный конспект середины лекции, она под номером 2.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на середине.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Сделай его понятным для человека, вычлени только самое важное для понимания лекции. Стунденты не пишут об лектори в третьем лице, и так далее.
Вот основные аспекты, которыми вы можете следовать при создании конспекта:
1) Обозначьте ключевые термины, понятия или определения.
2) Оформи их в отдельном логическом блоке
3) Убедитесь, что текст является академическим и соответствует стандартам.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""


end_of_text = """
Ваша задача — создать детализированный конспект конца лекции, она под номеров 3.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на заключительной части.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Сделай его понятным для человека, вычлени только самое важное для понимания лекции. Стунденты не пишут об лектори в третьем лице, и так далее.
Вот основные аспекты, которыми вы можете следовать при создании конспекта:
1) Опишите основные выводы и заключения, сделанные преподавателем в конце лекции.
2) Оформи их в отдельном логическом блоке
3) Убедитесь, что текст является академическим и соответствует стандартам.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""
