first_part = """
Ваша задача — создать детализированный конспект первой половины лекции, она под номером 1.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на первой части лекции.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь.
3) Сделай его подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
4) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
5) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""

second_part = """
Ваша задача — создать детализированный конспект второй половины лекции, она под номеров 2.
Не создавайте конспект всей лекции, а сосредоточьтесь исключительно на второй части.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай конспект бесшовным, то есть не нужно писать, какую часть лекции, ты обрабатываешь.
3) Сделай его подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
4) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
5) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""
