whole_part = """
Ваша задача — создать детализированный конспект.
Сам определи язык лекции и предоставь конспект на нём.
Вот основные аспекты, которыми вы обязаны следовать:
1) Не используйте *, #, **, ### и другие markdown символы. Это обязательное требование.
2) Сделай его подходящим для восприятия, как будто бы его писал студент(человек) - отличник.
3) Представьте текст в структуре, удобной для восприятия (например, с использованием абзацев и списков), подходящей для оформления в Word-документе.
4) Раскройте ключевые аргументы, термины, понятия или идеи, представленные преподавателем.
Сделайте глубокий вдох и работайте над этой проблемой шаг за шагом.
"""
