start_message = """
Привет! Я - Конспект-бот, ваш помощник в создании конспектов.

Я умею:

🔹 Автоматически создавать подробные конспекты из аудио записей
🔹 Структурировать текст с помощью заголовков и нумерации

Чтобы начать, просто отправьте мне аудиосообщение с лекцией или докладом. Я быстро создам для вас подробный конспект, чтобы вы могли сосредоточиться на изучении материала, а не на рутинных записях.

Начните экономить время уже сегодня с помощью Конспект-бота!
"""

subscription = """
Здесь будет информация о подписке.

Пример:

📝 Подписка на конспектирование аудиосообщений

Хотите получать готовые конспекты на основе ваших аудиосообщений? Подпишитесь на нашу услугу и наслаждайтесь удобством!

✅ Преимущества подписки:

Отправляйте нам аудиосообщения для конспектирования.
Получайте конспекты в формате документа.

💬 Как подписаться:
Отправьте команду /pay, чтобы начать пользоваться нашей услугой. Оплата доступна в нескольких вариантах.

🔒 Важно:
Пожалуйста, убедитесь, что ваша подписка активна перед отправкой аудиосообщений. Подписка дает доступ к услуге конспектирования на определенный срок.

Наслаждайтесь удобством и эффективностью с нашим сервисом!
"""

acknowledgements = """
🎉 Спасибо, что подписались на наш сервис! 📝

Теперь вы будете получать конспекты, созданные на основе ваших аудиосообщений.

🎤 Чтобы начать, просто отправьте нам аудиосообщение, и мы автоматически создадим для вас подробный конспект. Вы сможете легко просматривать и делиться этими конспектами в чате.

🚀 Наслаждайтесь нашим сервисом и не стесняйтесь обращаться к нам, если у вас возникнут какие-либо вопросы или предложения!
"""

audio_message_accepted = """
🎧 Ваше аудиосообщение принято и обрабатывается.
"""
