start_message = """
Привет! Я — Конспект-бот Конспектиус, ваш помощник в создании конспектов. 📚

Я умею:

🔹 Автоматически создавать подробные конспекты из аудио записей 🎧
🔹 Структурировать текст с помощью заголовков и нумерации 📑
🔹 Подчеркивать ключевые моменты и выделять важную информацию ✍️
🔹 Подготавливать конспекты для разных аудио: лекции, статьи, книги и т.д. 🎓
🔹 Создавать конспекты на всех основных языках мира 🌍

Чтобы начать, нажмите на кнопку "Сделай конспект" 👇.

Я быстро создам для вас подробный конспект, чтобы вы могли сосредоточиться на изучении материала, а не на рутинных записях 📘.

Не тратьте время зря — начните экономить время и улучшать продуктивность с помощью Конспектиуса уже сегодня! 🚀
"""

acknowledgements = """
🎉 Спасибо, что подписались на наш сервис! 📝

Теперь вы будете получать конспекты, созданные на основе ваших аудиосообщений.

🎤 Чтобы начать, просто отправьте нам аудиосообщение, и мы автоматически создадим для вас подробный конспект. Вы сможете легко просматривать и делиться этими конспектами в чате.

🚀 Наслаждайтесь нашим сервисом и не стесняйтесь обращаться к нам, если у вас возникнут какие-либо вопросы или предложения!
"""

audio_message_accepted = """
🎧 Ваше аудиосообщение принято и обрабатывается.
"""

audio_language = """
Выберите язык для расшифровки аудио сообщения 🌍

Если вы не знаете язык аудио, нажмите определить автоматически, и нейросеть распознает его сама 🤖:
"""

conspect_length = """
Выберите желаемую длину конспекта. В зависимости от длины конспекта, нейросеть Конспектиус генерирует информацию с разной степенью детализации 🧐:

*Саммари*: Краткое изложение ключевых мыслей из лекции. 📄

*Подробный конспект*: Полное и детализированное описание всех нюансов. 📚

*Определить автоматически*: Нейросеть подберет оптимальный уровень детализации автоматически. 🤖

Выбор зависит от того, сколько информации вам нужно — от краткого резюме до глубокого анализа. ✅
"""

error_message = """
Пожалуйста, попробуйте отправить аудио файл снова, нажав на кнопку Сделать конспект или сообщите об ошибке, нажав на кнопку ниже. ⬇️
"""

subscription = """
Здесь будет информация о подписке. Пока все бесплатно. Кайфуйте!
"""

# subscription = """
# Подписка на конспектирование аудиосообщений с Нейросетью "Конспектиус" 📚

# При первом использовании вам даётся 5 конспектов на тестирование, подойдёт ли вам серивис, или нет.

# 💬 Как подписаться:
# 1) Переведите нужную сумму, с уплатой коммисии, на карту: 1234 5678 9123 4567
# 2) Отправьте скриншот успешной транзакции на аккаунт @m4demeinsane
# 3) После подтверждения, ваша подписка будет активирована, и вы сможете отправлять аудиофайлы на конспектирование.

# 💰 Цена подписки всего 199 рублей!

# 📅 В рамках подписки вы получаете 15 конспектов в месяц.

# 📈 Если вам нужно больше, вы можете докупить дополнительные конспекты по выгодной цене. (В разработке)
# """

start_conspect_menu = """
1. Пришлите аудио по первой кнопке 🎧
2. Подождите загрузку на сервер ⏳
3. После сообщения об успешной загрузке аудио закройте мини-приложение
4. Нажмите на кнопку Аудио скинуто ✅

В случае ошибки обратитесь в [группу поддержки](https://t.me/+HjWqmBJSRxk2YmNi), где вам оперативно помогут.
"""

error_message_send = """
Вы можете попросить помощь, сообщить об ошибке или предложить улучшения для проекта по кнопке ниже 👇

Спасибо, за проявленный интерес к нашему проекту.
"""

donate = """
Спасибо, что используете этого бота! 🙏

Каждый донат помогает мне сохранять бесплатные тарифы для всех.

Нажмите кнопку ниже, чтобы сделать добровольное пожертвование. 👇

Ваша поддержка идет на:
🔸 Аренду серверов для обработки аудио;
🔸 Улучшение качества нейросети;
🔸 Добавление новых функций.

💡 Даже 50 рублей помогут боту работать быстрее и стабильнее!

🌟 Спасибо за вашу доброту!
Вы делаете обучение доступнее ❤️.
"""
