start_message = """
Привет! Я — Конспект-бот Конспектиус, ваш помощник в создании конспектов. 📚

Я умею:

🔹 Автоматически создавать подробные конспекты из аудио записей 🎧
🔹 Структурировать текст с помощью заголовков и нумерации 📑
🔹 Подчеркивать ключевые моменты и выделять важную информацию ✍️
🔹 Подготавливать конспекты для разных аудио: лекции, статьи, книги и т.д. 🎓
🔹 Создавать конспекты на всех основных языках мира 🌍

Чтобы начать, нажмите на кнопку "Сделай конспект" 👇. Я быстро создам для вас подробный конспект, чтобы вы могли сосредоточиться на изучении материала, а не на рутинных записях 📘.

Не тратьте время зря — начните экономить время и улучшать продуктивность с помощью Конспектиуса уже сегодня! 🚀
"""

subscription = """
Здесь будет информация о подписке.

Пример:

📝 Подписка на конспектирование аудиосообщений

Хотите получать готовые конспекты на основе ваших аудиосообщений? Подпишитесь на нашу услугу и наслаждайтесь удобством!

✅ Преимущества подписки:

Отправляйте нам аудиосообщения для конспектирования.
Получайте конспекты в формате документа.

💬 Как подписаться:
Отправьте команду /pay, чтобы начать пользоваться нашей услугой. Оплата доступна в нескольких вариантах.

🔒 Важно:
Пожалуйста, убедитесь, что ваша подписка активна перед отправкой аудиосообщений. Подписка дает доступ к услуге конспектирования на определенный срок.

Наслаждайтесь удобством и эффективностью с нашим сервисом!
"""

acknowledgements = """
🎉 Спасибо, что подписались на наш сервис! 📝

Теперь вы будете получать конспекты, созданные на основе ваших аудиосообщений.

🎤 Чтобы начать, просто отправьте нам аудиосообщение, и мы автоматически создадим для вас подробный конспект. Вы сможете легко просматривать и делиться этими конспектами в чате.

🚀 Наслаждайтесь нашим сервисом и не стесняйтесь обращаться к нам, если у вас возникнут какие-либо вопросы или предложения!
"""

audio_message_accepted = """
🎧 Ваше аудиосообщение принято и обрабатывается.
"""

audio_language = """
Выберите язык для расшифровки аудио сообщения 🌍

Если вы не знаете язык аудио, нажмите определить автоматически, и нейросеть распознает его сама 🤖:
"""

conspect_length = """
Выберите желаемую длину конспекта. В зависимости от длины конспекта, нейросеть Конспектиус генерирует информацию с разной степенью детализации 🧐:

*Саммари*: Краткое изложение ключевых мыслей из лекции. 📄

*Основное содержание*: Развернутое объяснение ключевых понятий и важных аспектов. 📝

*Максимально подробный конспект*: Полное и детализированное описание всех нюансов. 📚

*Определить автоматически*: Нейросеть подберет оптимальный уровень детализации автоматически. 🤖

Выбор зависит от того, сколько информации вам нужно — от краткого резюме до глубокого анализа. ✅
"""

error_message = """
Пожалуйста, попробуйте отправить аудио файл снова, нажав на кнопку 'Сделать конспект' или сообщите об ошибке, нажав на кнопку ниже. ⬇️
"""

subscription = """
Подписка на конспектирование аудиосообщений с Нейросетью "Конспектиус" 📚

При первом использовании вам даётся 5 конспектов на тестирование, подойдёт ли вам серивис, или нет.

💬 Как подписаться:
1) Переведите нужную сумму, с уплатой коммисии, на карту: 1234 5678 9123 4567
2) Отправьте скриншот успешной транзакции на аккаунт @m4demeinsane
3) После подтверждения, ваша подписка будет активирована, и вы сможете отправлять аудиофайлы на конспектирование.

💰 Цена подписки всего 199 рублей!

📅 В рамках подписки вы получаете 15 конспектов в месяц.

📈 Если вам нужно больше, вы можете докупить дополнительные конспекты по выгодной цене. (В разработке)
"""
